#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-GEwqLdpjcFSJtCdp

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.security_demo.aws_api_gateway_rest_api.api: Refreshing state... [id=e3vh22gyhl]
module.ansible.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:531133914787:cluster/ansible]
module.security_demo.aws_api_gateway_api_key.api_key: Refreshing state... [id=vo9krzvmif]
module.endpoint_01.aws_iam_role.iam_for_lambda: Refreshing state... [id=tf_lambda_role]
module.tennis.aws_s3_bucket.bucket2: Refreshing state... [id=pp-bucket2-us-east-1-531133914787]
module.ansible.aws_ecs_task_definition.task: Refreshing state... [id=ansible]
module.tennis.aws_s3_bucket.bucket1: Refreshing state... [id=pp-bucket1-us-east-1-531133914787]
module.tennis.aws_s3_bucket.bucket_trail: Refreshing state... [id=pp-buckettrail-us-east-1-531133914787]
module.ansible.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:531133914787:service/ansible/ansible]
module.security_demo.aws_api_gateway_request_validator.validator: Refreshing state... [id=h6gjmy]
module.endpoint_01.aws_api_gateway_resource.resource: Refreshing state... [id=jdhc55]
module.security_demo.aws_api_gateway_deployment.deployment: Refreshing state... [id=2gtu9o]
module.security_demo.aws_api_gateway_integration.options: Refreshing state... [id=agi-e3vh22gyhl-08263f8zuc-OPTIONS]
module.endpoint_01.aws_api_gateway_model.model: Refreshing state... [id=qwfsgs]
module.security_demo.aws_api_gateway_method.options: Refreshing state... [id=agm-e3vh22gyhl-08263f8zuc-OPTIONS]
module.endpoint_01.aws_api_gateway_integration.options: Refreshing state... [id=agi-e3vh22gyhl-jdhc55-OPTIONS]
module.endpoint_01.aws_api_gateway_method.options: Refreshing state... [id=agm-e3vh22gyhl-jdhc55-OPTIONS]
module.security_demo.aws_api_gateway_method_settings.all: Refreshing state... [id=e3vh22gyhl-test-*/*]
module.security_demo.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-e3vh22gyhl-08263f8zuc-OPTIONS-200]
module.security_demo.aws_api_gateway_usage_plan.usage_plan: Refreshing state... [id=9zgd89]
module.tennis.aws_s3_bucket_policy.allow_cloudtrail_access: Refreshing state... [id=pp-buckettrail-us-east-1-531133914787]
module.tennis.aws_s3_bucket_public_access_block.bucket_trail: Refreshing state... [id=pp-buckettrail-us-east-1-531133914787]
module.tennis.aws_s3_bucket_public_access_block.bucket2: Refreshing state... [id=pp-bucket2-us-east-1-531133914787]
module.tennis.aws_s3_bucket_acl.bucket2: Refreshing state... [id=pp-bucket2-us-east-1-531133914787,private]
module.tennis.aws_s3_bucket_acl.bucket_trail: Refreshing state... [id=pp-buckettrail-us-east-1-531133914787,private]
module.endpoint_01.aws_api_gateway_method.method: Refreshing state... [id=agm-e3vh22gyhl-jdhc55-POST]
module.security_demo.aws_wafv2_web_acl.waf_regional: Refreshing state... [id=3d32b9d4-53a4-431a-b6af-53ae33d291dd]
module.tennis.aws_iam_role.role: Refreshing state... [id=pp-role-us-east-1-531133914787]
module.tennis.aws_cloudwatch_event_rule.rule: Refreshing state... [id=pp-rule-us-east-1-531133914787]
module.tennis.aws_s3_bucket_acl.bucket1: Refreshing state... [id=pp-bucket1-us-east-1-531133914787,private]
module.tennis.aws_s3_bucket_public_access_block.bucket1: Refreshing state... [id=pp-bucket1-us-east-1-531133914787]
module.tennis.aws_cloudtrail.trail: Refreshing state... [id=pp-cloudtrail-us-east-1-531133914787]
module.endpoint_01.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-e3vh22gyhl-jdhc55-OPTIONS-200]
module.security_demo.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-e3vh22gyhl-08263f8zuc-OPTIONS-200]
module.endpoint_01.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-e3vh22gyhl-jdhc55-OPTIONS-200]
module.security_demo.aws_api_gateway_usage_plan_key.plan_key: Refreshing state... [id=vo9krzvmif]
module.endpoint_01.aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-e3vh22gyhl-jdhc55-POST-200]
module.endpoint_01.aws_lambda_function.function: Refreshing state... [id=tf_lambda]
module.endpoint_01.aws_api_gateway_integration.integration: Refreshing state... [id=agi-e3vh22gyhl-jdhc55-POST]
module.endpoint_01.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.tennis.aws_lambda_function.function: Refreshing state... [id=pp-lambda-us-east-1-531133914787]
module.tennis.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromEventBridge]
module.tennis.aws_cloudwatch_event_target.lambda: Refreshing state... [id=pp-rule-us-east-1-531133914787-pp-lambda-us-east-1-531133914787]
module.tennis.aws_cloudwatch_dashboard.dashboard: Refreshing state... [id=tennis-dashboard]
module.security_demo.aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/3d32b9d4-53a4-431a-b6af-53ae33d291dd,arn:aws:apigateway:us-east-1::/restapis/e3vh22gyhl/stages/test]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ansible.aws_ecs_cluster.cluster has changed
  ~ resource "aws_ecs_cluster" "cluster" {
        id                 = "arn:aws:ecs:us-east-1:531133914787:cluster/ansible"
        name               = "ansible"
      + tags               = {}
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ansible.aws_ecs_service.service has changed
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:531133914787:service/ansible/ansible"
        name                               = "ansible"
      + tags                               = {}
        # (16 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.ansible.aws_ecs_task_definition.task has changed
  ~ resource "aws_ecs_task_definition" "task" {
        id                       = "ansible"
      + tags                     = {}
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ansible.aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:531133914787:service/ansible/ansible"
        name                               = "ansible"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:531133914787:task-definition/ansible:4" -> (known after apply)
        # (15 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.ansible.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:531133914787:task-definition/ansible:4" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0 -> null
                  - environment      = [] -> null
                  - mountPoints      = [] -> null
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (4 unchanged elements hidden)
                },
            ]
        )
      ~ execution_role_arn       = "arn:aws:iam::531133914787:role/ecsTaskExecutionRole" -> (known after apply) # forces replacement
      ~ id                       = "ansible" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ansible.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecution"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ]
      + max_session_duration  = 3600
      + name                  = "ansible_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.


```

</details>

*Pusher: @fer1035, Action: `pull_request`*